avnet-iotconnect/iotc-stm32-n6-w6x-kvs-webrtc/Middlewares/ST/ST67W6X_Network_Driver/Driver/W61_bus/spi_iface.c
/**
  ******************************************************************************
  * @file    spi_iface.c
  * @brief   SPI bus interface implementation
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/**
  * This file is based on QCC74xSDK provided by Qualcomm.
  * See https://git.codelinaro.org/clo/qcc7xx/QCCSDK-QCC74x for more information.
  *
  * Reference source: examples/stm32_spi_host/QCC743_SPI_HOST/Core/Src/spi_iface.c
  */

/* Includes ------------------------------------------------------------------*/
#include <inttypes.h>
#include <stdio.h>
#include <string.h>
#include <stdbool.h>
#include <stdlib.h>

/* FreeRTOS includes. */
#include "FreeRTOS.h"
#include "queue.h"
#include "task.h"
#include "semphr.h"
#include "event_groups.h"

/* For redefinitions purposes */
#include "w61_default_config.h"

#include "spi_iface.h"
#include "spi_port.h"

/** SPI header magic code */
#define SPI_HEADER_MAGIC_CODE           0x55AAU

#ifndef SPI_THREAD_STACK_SIZE
/** SPI thread stack size */
#define SPI_THREAD_STACK_SIZE           768U
#endif /* SPI_THREAD_STACK_SIZE */

#ifndef SPI_THREAD_PRIO
/** SPI thread priority */
#define SPI_THREAD_PRIO                 53
#endif /* SPI_THREAD_PRIO */

#ifndef SPI_TXQ_LEN
/** SPI Tx Queue length */
#define SPI_TXQ_LEN                     8U
#endif /* SPI_TXQ_LEN */

#ifndef SPI_RXQ_LEN
/** SPI Rx Queue length */
#define SPI_RXQ_LEN                     8U
#endif /* SPI_RXQ_LEN */

/** Maximum digits for 64-bit integer string representation */
#define STR64BIT_DIGIT                  (20 + 1)

/** SPI message header structure */
struct spi_header
{
  /** Magic number for header validation */
  uint16_t magic;
  /** Length of the payload */
  uint16_t len;
  /** Header version */
  uint8_t version : 2;
  /** Peer RX is stalled */
  uint8_t rx_stall : 1;
  /** Header flags */
  uint8_t flags : 5;
  /** Message type */
  uint8_t type;
  /** Reserved for future use */
  uint16_t rsvd;
} __attribute__((packed));

/** Initialize SPI header */
#define SPI_HEADER_INIT(h, _type, _len) do {                                     \
                                             (h)->magic = SPI_HEADER_MAGIC_CODE; \
                                             (h)->type = _type;                  \
                                             (h)->version = 0;                   \
                                             (h)->rx_stall = 0;                  \
                                             (h)->flags = 0;                     \
                                             (h)->len = _len;                    \
                                             (h)->rsvd = 0;                      \
                                           } while (false)

/** SPI transfer state */
enum
{
  SPI_XFER_STATE_IDLE,
  SPI_XFER_STATE_FIRST_PART,
  SPI_XFER_STATE_SECOND_PART,
  SPI_XFER_STATE_TXN_DONE,
};

/** SPI transfer flags */
#define SPI_XFER_F_SKIP_FIRST_TXN_WAIT  0x1U

/** Increment SPI statistics field */
#define SPI_STAT_INC(stat, mb, val) (stat)->mb += (val)

/**
  * SPI transfer engine structure
  * This structure manages the state and resources for SPI communication,
  * including support for multiple receive queues bound to different message types.
  */
struct spi_xfer_engine
{
  /** Transfer task handle */
  TaskHandle_t task;
  /** Stop flag for clean shutdown */
  int32_t stop;
  /** Initialization flag */
  int32_t initialized;
  /** Event flags for synchronization */
  EventGroupHandle_t event;
  /** Current transfer state */
  int32_t state;
  /** Slave RX is stalled */
  int32_t rx_stall;
  /** Single transmit queue */
  QueueHandle_t txq;
  /** Array of receive queues by type */
  QueueHandle_t rxq[SPI_MSG_CTRL_TRAFFIC_TYPE_MAX];
  /** Bitmap of bound traffic types */
  uint8_t rxq_bound;
  /** Current transmit buffer */
  struct spi_buffer *txbuf;
  /** Transfer statistics */
  struct spi_stat stat;
  /** Received data callbacks for each traffic type */
  spi_rxd_notify_func_t cb[SPI_MSG_CTRL_TRAFFIC_TYPE_MAX];
  /** Callback arguments for each traffic type */
  void *cb_arg[SPI_MSG_CTRL_TRAFFIC_TYPE_MAX];
};

/** SPI transfer engine instance */
static struct spi_xfer_engine xfer_engine = {0};

/* Tick of the current module rx_stall episode start (|1 so never 0; 0 = no
 * stall active).  Single engine instance, engine-task-only access.
 * (2026-07-20 stall observability + escape.) */
static TickType_t spi_stall_since = 0U;

/** SPI buffer alignment mask */
#define SPI_BUF_ALIGN_MASK              (0x0003U)

/** SPI transfer trace points */
enum
{
  SPI_TP_NONE = 0,
  SPI_TP_WRITE = 1,
  SPI_TP_ASSERT_CS = 2,
  SPI_TP_SLAVE_TXN_RDY = 3,
  SPI_TP_FIRST_TXN_START = 4,
  SPI_TP_FIRST_TXN_END = 5,
  SPI_TP_SECOND_TXN_START = 6,
  SPI_TP_SECOND_TXN_END = 7,
  SPI_TP_WAIT_HDR_ACK_START = 8,
  SPI_TP_HDR_ACKED = 9,
  SPI_TP_WAIT_HDR_ACK_END = 10,
  SPI_TP_DEASSERT_CS = 11,
  SPI_TP_READ = 12,
  SPI_TP_NUM = 12,
};

/* Private function prototypes -----------------------------------------------*/
/**
  * @brief  Set the traffic type in the SPI buffer
  * @param  buf: Pointer to the SPI buffer
  * @param  type: Traffic type to set
  */
static inline void spi_buffer_set_traffic_type(struct spi_buffer *buf, uint8_t type);

/**
  * @brief  Get the traffic type from the SPI buffer
  * @param  buf: Pointer to the SPI buffer
  * @return Traffic type
  */
static inline uint8_t spi_buffer_get_traffic_type(struct spi_buffer *buf);

/**
  * @brief  Push data to the front of the SPI buffer
  * @param  buf: Pointer to the SPI buffer
  * @param  size: Size of the data to push
  * @return Pointer to the start of the pushed data
  */
static inline void *spi_buffer_push(struct spi_buffer *buf, uint32_t size);

/**
  * @brief  Pull data from the front of the SPI buffer
  * @param  buf: Pointer to the SPI buffer
  * @param  size: Size of the data to pull
  * @return Pointer to the start of the remaining data
  */
static inline void *spi_buffer_pull(struct spi_buffer *buf, uint32_t size);

/**
  * @brief  Allocate a SPI buffer
  * @param  size: Size of the buffer to allocate
  * @param  reserve: Reserved size for internal use
  * @return Pointer to the allocated buffer, or NULL on failure
  */
static struct spi_buffer *spi_buffer_alloc(uint32_t size, uint32_t reserve);

/**
  * @brief  Get transmit buffer from the SPI transfer engine
  * @param  engine: Pointer to the SPI transfer engine
  * @return Pointer to the transmit buffer
  */
static struct spi_buffer *spi_get_txbuf(struct spi_xfer_engine *engine);

/**
  * @brief  Validate the SPI header
  * @param  hdr: Pointer to the SPI header
  * @return 1 if valid, 0 if invalid
  */
static int32_t inline spi_header_validate(struct spi_header *hdr);

/**
  * @brief  Wait for a specific event in the SPI transfer engine
  * @param  evnt_ctx: Event context
  * @param  event: Event to wait for
  * @param  timeout_ms: Timeout in milliseconds
  * @return 0 on success, negative error code on failure
  */
static int32_t spi_wait_event(void *evnt_ctx, uint32_t event, int32_t timeout_ms);

/**
  * @brief  Clear a specific event in the SPI transfer engine
  * @param  engine: Pointer to the SPI transfer engine
  * @param  event: Event to clear
  * @return 0 on success, negative error code on failure
  */
static int32_t inline spi_clear_event(struct spi_xfer_engine *engine, uint32_t event);

/**
  * @brief  Perform a full-duplex SPI transfer
  * @param  engine: Pointer to the SPI transfer engine
  * @param  tx_buf: Pointer to the transmit buffer
  * @param  rx_buf: Pointer to the receive buffer
  * @param  len: Length of the transfer
  * @return 0 on success, negative error code on failure
  */
static int32_t spi_txrx(struct spi_xfer_engine *engine, void *tx_buf, void *rx_buf, uint16_t len);

/**
  * @brief  Perform a SPI transmit-only operation
  * @param  engine: Pointer to the SPI transfer engine
  * @param  rx_buf: Pointer to the receive buffer
  * @param  len: Length of the transmit
  * @return 0 on success, negative error code on failure
  */
static int32_t spi_rx(struct spi_xfer_engine *engine, void *rx_buf, uint16_t len);

/**
  * @brief  Perform a SPI transaction with the given buffer
  * @param  engine: Pointer to the SPI transfer engine
  * @param  txbuf: Pointer to the transmit buffer
  * @param  wait_txn_rdy: Flag to indicate whether to wait for transaction ready
  * @return 0 on success, negative error code on failure
  */
static int32_t spi_xfer_one(struct spi_xfer_engine *engine, struct spi_buffer *txbuf,
                            int32_t wait_txn_rdy);

/**
  * @brief  Perform SPI transfers based on the engine state and flags
  * @param  engine: Pointer to the SPI transfer engine
  * @param  flags: Transfer flags
  * @return 0 on success, negative error code on failure
  */
static int32_t spi_do_xfer(struct spi_xfer_engine *engine, uint32_t flags);

/**
  * @brief  SPI transfer engine task
  * @param  arg: Task argument
  */
static void spi_xfer_engine_task(void *arg);

/**
  * @brief  SPI transaction complete callback
  */
static void spi_on_transaction_complete(void);

/**
  * @brief  Convert a 64-bit number to string
  * @param  out: Output string buffer
  * @param  out_strlen: Length of the output buffer
  * @param  num: 64-bit number to convert
  */
static void num2string64(char *out, int32_t out_strlen, const uint64_t num);

/**
  * @brief  Display SPI transaction statistics
  * @param  stat: Pointer to the statistics structure
  */
static void spi_show_stat(struct spi_stat *stat);

/* Functions Definition ------------------------------------------------------*/
static inline void spi_buffer_set_traffic_type(struct spi_buffer *buf, uint8_t type)
{
  buf->cb[0] = type;
}

static inline uint8_t spi_buffer_get_traffic_type(struct spi_buffer *buf)
{
  return buf->cb[0];
}

/* For prepending data like header. */
static inline void *spi_buffer_push(struct spi_buffer *buf, uint32_t size)
{
  char *p, *start, *data;

  if (buf == NULL)
  {
    return NULL;
  }

