avnet-iotconnect/iotc-stm32-n6-w6x-kvs-webrtc/Middlewares/ST/ST67W6X_Network_Driver/Driver/W61_bus/spi_iface.c
  if (size == 0U)
  {
    return buf->data;
  }

  p = (char *)buf;
  data = buf->data;
  start = p + sizeof(struct spi_buffer);
  if ((data - size) < start)
  {
    spi_err("Illegal try of spi buffer push!\n");
    return NULL;
  }

  buf->data = data - size;
  buf->len += size;
  return buf->data;
}

/* For removing leading data like header. */
static inline void *spi_buffer_pull(struct spi_buffer *buf, uint32_t size)
{
  char *p, *end, *data;

  if (buf == NULL)
  {
    return NULL;
  }

  if (size == 0U)
  {
    return buf->data;
  }

  p = (char *)buf;
  data = buf->data;
  end = p + sizeof(struct spi_buffer) + buf->cap;
  if ((data + size) > end)
  {
    spi_err("Illegal try of spi buffer pull\n");
    return NULL;
  }

  buf->data = data + size;
  buf->len -= size;
  return buf->data;
}

static struct spi_buffer *spi_buffer_alloc(uint32_t size, uint32_t reserve)
{
  uint32_t cap;
  uint32_t extra;
  struct spi_buffer *buf;
  uint32_t desc_size = sizeof(struct spi_buffer);

  cap = (size + reserve + SPI_BUF_ALIGN_MASK) & ~SPI_BUF_ALIGN_MASK;
  buf = pvPortMalloc(cap + desc_size);
  if (buf == NULL)
  {
    return NULL;
  }

  buf->flags = 0;
  buf->len = size;
  buf->cap = cap;
  buf->data = (char *)buf + desc_size + reserve;
  (void)memset(buf->cb, 0, sizeof(buf->cb));
  /* Fill in the debug pattern. */
  extra = cap - size - reserve;
  while (extra > 0U)
  {
    uint8_t *p = (uint8_t *)buf + desc_size;

    p[cap - extra] = 0x88;
    extra--;
  }
  return buf;
}

struct spi_buffer *spi_tx_buffer_alloc(uint32_t size)
{
  return spi_buffer_alloc(size, sizeof(struct spi_header));
}

void spi_buffer_free(struct spi_buffer *buf)
{
  if (buf)
  {
    vPortFree(buf);
  }
}

/* Get tx buffer from in non-blocking mode. */
static struct spi_buffer *spi_get_txbuf(struct spi_xfer_engine *engine)
{
  struct spi_buffer *buf = NULL;
  BaseType_t ret;

  if (engine->txbuf != NULL)
  {
    return engine->txbuf;
  }

  ret = xQueueReceive(engine->txq, &buf, 0);
  if (ret != pdTRUE)
  {
    buf = NULL;
  }

  engine->txbuf = buf;
  if (buf != NULL)
  {
    SPI_STAT_INC(&engine->stat, tx_pkts, 1U);
    SPI_STAT_INC(&engine->stat, tx_bytes, buf->len);
  }
  return buf;
}

/* Return 1 if the header is valid. */
static int32_t inline spi_header_validate(struct spi_header *hdr)
{
  if (hdr->magic != SPI_HEADER_MAGIC_CODE)
  {
    spi_err("Invalid magic 0x%" PRIx16 "\n", hdr->magic);
    return 0;
  }

  if (hdr->len > SPI_XFER_MTU_BYTES)
  {
    spi_err("invalid len %" PRIu16 "\n", hdr->len);
    return 0;
  }
  return 1;
}

static int32_t spi_wait_event(void *evnt_ctx, uint32_t event, int32_t timeout_ms)
{
  EventBits_t bits;
  TickType_t ticks;
  struct spi_xfer_engine *engine = (struct spi_xfer_engine *)evnt_ctx;

  if (timeout_ms >= 0)
  {
    ticks = pdMS_TO_TICKS(timeout_ms);
  }
  else
  {
    ticks = portMAX_DELAY;
  }

  bits = xEventGroupWaitBits(engine->event, event, pdTRUE, pdFALSE, ticks);
  if ((bits & event) != 0U)
  {
    return 1;
  }

  return 0;
}

static int32_t inline spi_clear_event(struct spi_xfer_engine *engine, uint32_t event)
{
  (void)xEventGroupClearBits(engine->event, event);
  return 0;
}

static int32_t spi_txrx(struct spi_xfer_engine *engine, void *tx_buf, void *rx_buf, uint16_t len)
{
  int32_t status;

  if ((engine == NULL) || (tx_buf == NULL) || (rx_buf == NULL))
  {
    return -1;
  }

  if (len == 0U)
  {
    return 0;
  }

  if (len <= SPI_DMA_XFER_SIZE_THRESHOLD)
  {
    status = spi_port_transfer(tx_buf, rx_buf, len, SPI_WAIT_POLL_XFER_TIMEOUT_MS);
    if (status < 0)
    {
      spi_err("spi txrx failed, %" PRIi32 "\n", status);
      SPI_STAT_INC(&engine->stat, io_err, 1U);
      return -2;
    }
  }
  else
  {
    status = spi_port_transfer_dma(tx_buf, rx_buf, len);
    if (status < 0)
    {
      spi_err("spi txrx failed, %" PRIi32 "\n", status);
      SPI_STAT_INC(&engine->stat, io_err, 1U);
      return -2;
    }
    /* Wait for spi transaction completion. */
    if (spi_wait_event(engine, SPI_EVT_HW_XFER_DONE, SPI_WAIT_MSG_XFER_TIMEOUT_MS) == 0)
    {
      spi_err("spi txrx transaction timeouted\n");
      SPI_STAT_INC(&engine->stat, wait_msg_xfer_timeouts, 1U);
      return -3;
    }
  }

  return 0;
}

static int32_t spi_rx(struct spi_xfer_engine *engine, void *rx_buf, uint16_t len)
{
  int32_t status;

  if ((engine == NULL) || (rx_buf == NULL))
  {
    return -1;
  }

  if (len == 0U)
  {
    return 0;
  }

  if (len <= SPI_DMA_XFER_SIZE_THRESHOLD)
  {
    status = spi_port_transfer(NULL, rx_buf, len, SPI_WAIT_POLL_XFER_TIMEOUT_MS);
    if (status < 0)
    {
      spi_err("spi rx failed, %" PRIi32 "\n", status);
      SPI_STAT_INC(&engine->stat, io_err, 1U);
      return -2;
    }
  }
  else
  {
    status = spi_port_transfer_dma(NULL, rx_buf, len);
    if (status < 0)
    {
      spi_err("spi rx failed, %" PRIi32 "\n", status);
      SPI_STAT_INC(&engine->stat, io_err, 1U);
      return -2;
    }
    /* Wait for spi transaction completion. */
    if (spi_wait_event(engine, SPI_EVT_HW_XFER_DONE, SPI_WAIT_MSG_XFER_TIMEOUT_MS) == 0)
    {
      spi_err("spi rx transaction timeouted\n");
      SPI_STAT_INC(&engine->stat, wait_msg_xfer_timeouts, 1U);
      return -3;
    }
  }

  return 0;
}

static int32_t spi_xfer_one(struct spi_xfer_engine *engine, struct spi_buffer *txbuf,
                            int32_t wait_txn_rdy)
{
  void *txp;
  int32_t ret;
  int32_t err = -1;
  uint16_t xfer_size;
  struct spi_header mh;
  struct spi_header *pmh;
  struct spi_header *psh;
  struct spi_buffer *rxbuf = NULL;
  int32_t rx_restore = 0;

  spi_trace(SPI_TP_NONE, "wait_txn_rdy %" PRIi32 "\n", wait_txn_rdy);
  engine->state = SPI_XFER_STATE_FIRST_PART;
  if (wait_txn_rdy != 0)
  {
    /* LOST-EDGE HARDENING (2026-07-20): TXN_RDY is an edge-only event; a
     * consumed/missed rising edge used to cost the full 2000 ms timeout
     * per lap with the head txbuf retained (multi-second TX stalls
     * quantized in 2 s).  Wait in short laps and accept the PIN LEVEL as
     * ready — if the line is high the module is ready regardless of
     * whether we caught the edge. */
    int32_t got = 0;
    uint32_t lap;
    for (lap = 0U; lap < (SPI_WAIT_TXN_TIMEOUT_MS / 100U); lap++)
    {
      if (spi_wait_event(engine, SPI_EVT_TXN_RDY, 100U) != 0)
      {
        got = 1;
        break;
      }
      if (spi_port_is_ready() != 0)
      {
        /* Edge missed but line is high: proceed. */
        spi_err("txn rdy edge missed, pin high - proceeding (lap %" PRIu32 ")\n", lap);
        got = 1;
        break;
      }
    }
    if (got == 0)
    {
      SPI_STAT_INC(&engine->stat, wait_txn_timeouts, 1U);
      spi_err("waiting for spi txn ready timeouted\n");
      return -1;
    }
  }

