avnet-iotconnect/iotc-stm32-n6-w6x-kvs-webrtc/Middlewares/ST/ST67W6X_Network_Driver/Driver/W61_bus/spi_iface.c
  /* Re-initialize events in case of pending ones. */
  (void)spi_clear_event(engine, SPI_EVT_HW_XFER_DONE | SPI_EVT_HDR_ACKED);

  /* Yes, this allocation will be wasted if there is no data from slave. */
  rxbuf = spi_buffer_alloc(SPI_XFER_MTU_BYTES + sizeof(struct spi_header), 0);
  if (rxbuf == NULL)
  {
    spi_err("No mem for rxbuf\n");
    SPI_STAT_INC(&engine->stat, mem_err, 1U);
    return -1;
  }

  spi_trace(SPI_TP_FIRST_TXN_START, "start the first transaction\n");
  if (txbuf != NULL)
  {
    uint16_t msglen;
    uint8_t type = spi_buffer_get_traffic_type(txbuf);

    if (engine->rx_stall == 0)
    {
      pmh = txbuf->data;

      msglen = txbuf->len - sizeof(struct spi_header);

      /* Initialize master header. */
      SPI_HEADER_INIT(pmh, type, msglen);
      txp = txbuf->data;
      xfer_size = (txbuf->len + SPI_BUF_ALIGN_MASK) & ~SPI_BUF_ALIGN_MASK;
    }
    else
    {
      SPI_HEADER_INIT(&mh, 0, 0);
      txp = &mh;
      xfer_size = sizeof(struct spi_header);
    }
  }
  else
  {
    /* Initialize master header. */
    SPI_HEADER_INIT(&mh, 0, 0);
    txp = &mh;
    xfer_size = sizeof(struct spi_header);
  }

  if (spi_txrx(engine, txp, rxbuf->data, xfer_size) != 0)
  {
    spi_err("Failed to do the first transaction\n");
    goto out;
  }

  psh = rxbuf->data;
  spi_trace(SPI_TP_FIRST_TXN_END,
            "slave spi header, magic 0x%" PRIx16 ", len (%" PRIu16 ", 0x%" PRIx16 "), version %" PRIu16
            ", type %" PRIx16 ", flags 0x%" PRIx16 ", rsvd 0x%" PRIx16 "\n",
            psh->magic, psh->len, psh->len, psh->version, psh->type, psh->flags, psh->rsvd);
  ret = spi_header_validate(psh);
  if (ret == 0)
  {
    spi_err("Invalid spi header from peer, magic 0x%" PRIx16 ", len (%" PRIu16 ", 0x%" PRIx16 "), version %" PRIu16
            ", type %" PRIx16 "flags 0x%" PRIx16 ", rsvd 0x%" PRIx16 "\n",
            psh->magic, psh->len, psh->len, psh->version, psh->type, psh->flags, psh->rsvd);
    SPI_STAT_INC(&engine->stat, hdr_err, 1U);
    goto out;
  }

  if (engine->rx_stall == 0)
  {
    if (psh->rx_stall != 0U)
    {
      SPI_STAT_INC(&engine->stat, rx_stall, 1U);
      spi_trace(SPI_TP_NONE, "Slave RX stalled\n");
      /* Stall observability (2026-07-20): the module withholding TX
       * credit is root-cause #1 for the whole-stack media stalls —
       * timestamp every episode. */
      spi_stall_since = xTaskGetTickCount() | 1U;   /* never 0 */
      spi_err("rx_stall BEGIN t=%" PRIu32 "\n", (uint32_t)spi_stall_since);
    }
  }
  else if (psh->rx_stall == 0U)
  {
    rx_restore = 1;
    spi_err("rx_stall END dur=%" PRIu32 "ms\n",
            (uint32_t)(xTaskGetTickCount() - (spi_stall_since & ~1U)));
    spi_stall_since = 0U;
  }
  else
  {
    /* Normal case */
  }
  engine->rx_stall = psh->rx_stall;

  /* Receive the remaining data from slave if any. */
  if ((psh->len + sizeof(struct spi_header)) > xfer_size)
  {
    uint8_t *rxp = (uint8_t *)rxbuf->data;
    uint16_t remain = psh->len + sizeof(struct spi_header) - xfer_size;

    spi_trace(SPI_TP_SECOND_TXN_START, "Receiving remaining data\n");
    engine->state = SPI_XFER_STATE_SECOND_PART;
    remain = (remain + SPI_BUF_ALIGN_MASK) & ~SPI_BUF_ALIGN_MASK;
    rxp += xfer_size;
    if (spi_rx(engine, rxp, remain) != 0)
    {
      spi_err("Failed to receive the remaining bytes\n");
      goto out;
    }
    spi_trace(SPI_TP_SECOND_TXN_END, "Remaining transfer completed\n");
  }

  /* Free txbuf after the message transaction. */
  if (txbuf != NULL)
  {
    if ((engine->rx_stall == 0) && (rx_restore == 0))
    {
      engine->txbuf = NULL;
      spi_buffer_free(txbuf);
    }
    else
    {
      /* STALL ESCAPE (2026-07-20): while the module asserts rx_stall the
       * head txbuf is retained and ALL traffic types behind it in the
       * single shared txq are frozen (media, MQTT, WSS, AT).  NETWORK
       * frames are droppable — after 1 s of continuous stall, drop the
       * retained head so the queue can make progress the moment the
       * module recovers; never drop AT frames (command/response pairing).
       */
      uint8_t stall_type = spi_buffer_get_traffic_type(txbuf);

      if (((stall_type == SPI_MSG_CTRL_TRAFFIC_NETWORK_STA) ||
           (stall_type == SPI_MSG_CTRL_TRAFFIC_NETWORK_AP)) &&
          (spi_stall_since != 0U) &&
          ((xTaskGetTickCount() - (spi_stall_since & ~1U)) > pdMS_TO_TICKS(1000U)))
      {
        engine->txbuf = NULL;
        spi_buffer_free(txbuf);
        SPI_STAT_INC(&engine->stat, rx_drop, 1U);
        spi_err("rx_stall >1s: dropped head net frame\n");
      }
    }
  }

  if (psh->len > 0U)
  {
    SPI_STAT_INC(&engine->stat, rx_pkts, 1U);
    SPI_STAT_INC(&engine->stat, rx_bytes, psh->len);
    (void)spi_buffer_pull(rxbuf, sizeof(struct spi_header));
    /* Rx buffer length fix-up */
    rxbuf->len = psh->len;
    /* Get message type from header and store in buffer's control block */
    uint8_t msg_type = psh->type;
    spi_buffer_set_traffic_type(rxbuf, msg_type);

    /*
     * Note: Thread safety consideration required here.
     * If a queue is unbound by another thread while we're accessing it,
     * or if multiple transfers are accessing rxq_bound bitmap concurrently,
     * race conditions could occur. Consider using appropriate synchronization.
     */

    /* Select appropriate queue based on type */
    if ((msg_type < (uint8_t)SPI_MSG_CTRL_TRAFFIC_TYPE_MAX) &&
        ((engine->rxq_bound & (1U << msg_type)) != 0U))
    {
      if (psh->len < 256U)
      {
        struct spi_buffer *rxbuf_resized = spi_buffer_alloc(psh->len, 0);
        if (rxbuf_resized == NULL)
        {
          spi_err("No mem for rxbuf\n");
          SPI_STAT_INC(&engine->stat, mem_err, 1U);
        }
        else
        {
          rxbuf_resized->flags = rxbuf->flags;
          (void)spi_port_memcpy(rxbuf_resized->data, rxbuf->data, psh->len);
          spi_buffer_free(rxbuf);
          rxbuf = rxbuf_resized;
        }
      }

      /* WEDGE FIX (2026-07-20): was portMAX_DELAY — if a consumer (netif
       * task / AT parser) stopped draining its rxq, the single engine
       * task blocked FOREVER with CS asserted, killing BOTH directions
       * for every traffic type.  Bounded wait makes the drop branch
       * below live; dropping one RX packet is strictly better than
       * wedging the sole bus servicer. */
      ret = xQueueSend(engine->rxq[msg_type], &rxbuf, pdMS_TO_TICKS(50U));
      if (ret != pdTRUE)
      {
        spi_err("type %d rxq full, msg discarded\n", msg_type);
        spi_buffer_free(rxbuf);
        SPI_STAT_INC(&engine->stat, rx_drop, 1U);
      }
      else
      {
        if (engine->cb[msg_type] != NULL)
        {
          engine->cb[msg_type](engine->cb_arg[msg_type]);
        }
      }
    }
    else
    {
      /* No queue bound for this type, discard message */
      spi_trace(SPI_TP_NONE, "No queue bound for type %d, msg discarded\r\n", msg_type);
      spi_buffer_free(rxbuf);
      SPI_STAT_INC(&engine->stat, rx_drop, 1U);
    }
  }
  else if (rxbuf != NULL)
  {
    spi_buffer_free(rxbuf);
  }
  else
  {
    /* No rx bytes to read */
  }

