avnet-iotconnect/iotc-stm32-n6-w6x-kvs-webrtc/Middlewares/ST/ST67W6X_Network_Driver/Driver/W61_bus/spi_iface.c
  /* Wait until slave acknowledged header.  BOUNDED (2026-07-20): the loop
   * used to spin indefinitely (100 ms laps) if the falling edge was missed
   * while the pin stayed high — cap at 5 laps and abort the transaction so
   * the engine always exits in finite time. */
  spi_trace(SPI_TP_WAIT_HDR_ACK_START, "waiting for header ack\n");
  {
    uint32_t ack_laps = 0U;
    while (spi_wait_event(engine, SPI_EVT_HDR_ACKED, SPI_WAIT_HDR_ACK_TIMEOUT_MS) == 0)
    {
      if (spi_port_is_ready() == 0)
      {
        break;
      }

      SPI_STAT_INC(&engine->stat, wait_hdr_ack_timeouts, 1U);

      if (++ack_laps >= 5U)
      {
        spi_err("hdr ack timeout after %" PRIu32 " laps, aborting txn\n", ack_laps);
        break;
      }
    }
  }
  spi_trace(SPI_TP_WAIT_HDR_ACK_END, "Got header ack\n");

  return 0;

out:
  spi_buffer_free(rxbuf);
  return err;
}

static int32_t spi_do_xfer(struct spi_xfer_engine *engine, uint32_t flags)
{
  struct spi_buffer *txbuf;
  int32_t rx_pending;
  int32_t wait_txn_rdy;

  while (true)
  {
    /* Get txbuf */
    txbuf = spi_get_txbuf(engine);

    /* Read data ready GPIO level */
    rx_pending = spi_port_is_ready();

    spi_trace(SPI_TP_NONE, "txbuf %" PRIuPTR ", rx_pending %" PRIi32 "\n", txbuf, rx_pending);
    /* Check if txbuf is valid or data is ready for transfer */
    if ((txbuf != NULL) || (rx_pending == 1))
    {
      /* Assert chip select */
      spi_trace(SPI_TP_ASSERT_CS, "Assert CS\n");
      (void)spi_port_set_cs(1);

      /* Transfer one packet */
      if ((flags & SPI_XFER_F_SKIP_FIRST_TXN_WAIT) != 0U)
      {
        flags &= ~SPI_XFER_F_SKIP_FIRST_TXN_WAIT;
        wait_txn_rdy = 0;
      }
      else
      {
        wait_txn_rdy = 1;
      }

      (void)spi_xfer_one(engine, txbuf, wait_txn_rdy);

      /* De-assert chip select */
      spi_trace(SPI_TP_DEASSERT_CS, "Deassert CS\n");
      (void)spi_port_set_cs(0);
      engine->state = SPI_XFER_STATE_TXN_DONE;
    }
    else
    {
      /* Neither txbuf nor rx_pending require processing, exit loop */
      break;
    }
  }

  return 0;
}

static void spi_xfer_engine_task(void *arg)
{
  EventBits_t bits;
  struct spi_xfer_engine *engine = arg;

  /* Wait for events and process them. */
  while (engine->stop == 0)
  {
    engine->state = SPI_XFER_STATE_IDLE;
    bits = SPI_EVT_TXN_PENDING | SPI_EVT_TXN_RDY;
    bits = xEventGroupWaitBits(engine->event, bits, pdTRUE, pdFALSE,
                               portMAX_DELAY);
    spi_trace(SPI_TP_NONE, "Got event bits %" PRIx32 "\n", bits);
    if ((bits & SPI_EVT_TXN_RDY) != 0U)
    {
      (void)spi_do_xfer(engine, SPI_XFER_F_SKIP_FIRST_TXN_WAIT);
    }
    else if ((bits & SPI_EVT_TXN_PENDING) != 0U)
    {
      (void)spi_do_xfer(engine, 0U);
    }
    else
    {
      /* Event not managed */
    }
  }
}

int32_t spi_transaction_init(void)
{
  int32_t ret;

  /* Initialize rxq array to NULL and rxq_bound to 0 */
  (void)memset(xfer_engine.rxq, 0, sizeof(xfer_engine.rxq));
  xfer_engine.rxq_bound = 0;

  /* Create event group for SPI transaction */
  xfer_engine.event = xEventGroupCreate();
  if (xfer_engine.event == NULL)
  {
    spi_err("Failed to create event group for SPI\n");
    ret = -1;
    goto error;
  }

  /* Create TX queue */
  xfer_engine.txq = xQueueCreate(SPI_TXQ_LEN, sizeof(void *));
  if (xfer_engine.txq == NULL)
  {
    spi_err("Failed to create txq\n");
    ret = -1;
    goto error;
  }

  if (spi_port_init(spi_on_transaction_complete) != 0)
  {
    ret = -1;
    goto error;
  }

  /* Create SPI transfer engine task */
  xfer_engine.stop = 0;
  (void)xTaskCreate(spi_xfer_engine_task, "spi_xfer_engine", SPI_THREAD_STACK_SIZE >> 2U,
                    &xfer_engine, SPI_THREAD_PRIO, &xfer_engine.task);

  if (xfer_engine.task == NULL)
  {
    spi_err("Failed to create spi xfer engine task\n");
    ret = -1;
    goto error;
  }

  /* Check the state of the slave data ready pin */
  if (spi_port_is_ready() == 1)
  {
    /* Set the TXN event if data is ready */
    (void)xEventGroupSetBits(xfer_engine.event, SPI_EVT_TXN_RDY);
  }

  xfer_engine.rx_stall = 0;
  xfer_engine.initialized = 1;
  return 0;

error:
  /* Clean up resources in case of error */
  if (xfer_engine.txq != NULL)
  {
    vQueueDelete(xfer_engine.txq);
    xfer_engine.txq = NULL;
  }

  if (xfer_engine.event != NULL)
  {
    vEventGroupDelete(xfer_engine.event);
    xfer_engine.event = NULL;
  }

  return ret;
}

int32_t spi_transaction_deinit(void)
{
  if (xfer_engine.task != NULL)
  {
    vTaskDelete(xfer_engine.task);
    xfer_engine.task = NULL;
  }

  /* Clean up resources in case of error */
  if (xfer_engine.txq != NULL)
  {
    vQueueDelete(xfer_engine.txq);
  }

  if (xfer_engine.event != NULL)
  {
    vEventGroupDelete(xfer_engine.event);
  }

  for (int32_t i = 0; i < (int32_t)SPI_MSG_CTRL_TRAFFIC_TYPE_MAX; i++)
  {
    if (xfer_engine.rxq[i] != NULL)
    {
      vQueueDelete(xfer_engine.rxq[i]);
    }
  }

  /* Clear xfer_engine context */
  (void)memset(&xfer_engine, 0, sizeof(struct spi_xfer_engine));

  (void)spi_port_deinit();

  return 0;
}

int32_t spi_read(struct spi_msg *msg, int32_t timeout_ms)
{
  BaseType_t ret;
  TickType_t ticks;
  struct spi_buffer *buf = NULL;
  uint8_t traffic_type = SPI_MSG_CTRL_TRAFFIC_AT_CMD; /* Default to AT commands */
  QueueHandle_t targetQ;

  /* Verify message is valid and operation type is supported */
  if ((msg == NULL) || ((msg->op_type != SPI_MSG_OP_DATA) && (msg->op_type != SPI_MSG_OP_BUFFER_PTR)))
  {
    return -1;
  }

  /* Verify appropriate fields based on operation type */
  if (msg->op_type == SPI_MSG_OP_DATA)
  {
    if ((msg->data == NULL) || (msg->data_len == 0U))
    {
      return -1;
    }
  }
  else if (msg->op_type == SPI_MSG_OP_BUFFER_PTR)
  {
    if (msg->buffer_ptr == NULL)
    {
      return -1;
    }
  }
  else
  {
  }

  /* Verify context is initialized */
  if (xfer_engine.initialized == 0)
  {
    spi_err("SPI transaction is NOT initialized!\n");
    return -2;
  }

  /* Process control information if present */
  if (msg->ctrl != NULL)
  {
    /* Check for traffic type control information */
    if (msg->ctrl->type == SPI_MSG_CTRL_TRAFFIC_TYPE)
    {
      /* Validate control data length */
      if ((msg->ctrl->len == SPI_MSG_CTRL_TRAFFIC_TYPE_LEN) && (msg->ctrl->val != NULL))
      {
        /* Extract traffic type */
        traffic_type = *((uint8_t *)msg->ctrl->val);
      }
      else
      {
        spi_err("Invalid traffic type control info\r\n");
      }
    }
  }

  /* Verify traffic type is valid and bound */
  if ((traffic_type >= (uint8_t)SPI_MSG_CTRL_TRAFFIC_TYPE_MAX) ||
      ((xfer_engine.rxq_bound & (1U << traffic_type)) == 0U))
  {
    spi_err("Traffic type %d not bound, operation not allowed\r\n", traffic_type);
    return -3;
  }

  /* Get the target queue for this traffic type */
  targetQ = xfer_engine.rxq[traffic_type];
  spi_trace(SPI_TP_READ, "spi_read type %d\r\n", traffic_type);

  /* Set up timeout value */
  if (timeout_ms < 0)
  {
    ticks = portMAX_DELAY;
  }
  else
  {
    ticks = pdMS_TO_TICKS(timeout_ms);
  }

  /* Process based on operation type */
  switch (msg->op_type)
  {
    case SPI_MSG_OP_DATA:
      /* Receive buffer from queue */
      ret = xQueueReceive(targetQ, &buf, ticks);
      if (ret != pdTRUE)
      {
        return -4;
      }

      /* Copy data with truncation handling */
      if (msg->data_len >= buf->len)
      {
        msg->data_len = buf->len;
        msg->flags &= ~SPI_MSG_F_TRUNCATED;
      }
      else
      {
        msg->flags |= SPI_MSG_F_TRUNCATED;
      }

