avnet-iotconnect/iotc-stm32-n6-w6x-kvs-webrtc/Middlewares/ST/ST67W6X_Network_Driver/Driver/W61_bus/spi_iface.c
      /* Copy data and free buffer */
      (void)spi_port_memcpy(msg->data, buf->data, msg->data_len);
      spi_buffer_free(buf);
      return msg->data_len;
      break;

    case SPI_MSG_OP_BUFFER_PTR:
      /* Receive buffer pointer directly into msg->buffer_ptr */
      ret = xQueueReceive(targetQ, msg->buffer_ptr, ticks);
      if (ret != pdTRUE)
      {
        return -4;
      }

      return (*(msg->buffer_ptr))->len;
      break;

    default:
      /* Types unmanaged in read mode */
      break;
  }

  /* Should never reach here, but just in case */
  return -1;
}

int32_t spi_write(struct spi_msg *msg, int32_t timeout_ms)
{
  BaseType_t ret;
  struct spi_buffer *buf;
  TickType_t ticks;
  uint8_t traffic_type = SPI_MSG_CTRL_TRAFFIC_AT_CMD;
  uint32_t data_len = 0;

  /* Verify message is valid and operation type is supported */
  if ((msg == NULL) || ((msg->op_type != SPI_MSG_OP_DATA) && (msg->op_type != SPI_MSG_OP_BUFFER)))
  {
    return -1;
  }

  /* Verify context is initialized */
  if (xfer_engine.initialized == 0)
  {
    spi_err("SPI transaction is NOT initialized!\r\n");
    return -2;
  }

  /* Process control information if present */
  if (msg->ctrl != NULL)
  {
    /* Check for traffic type control information */
    if (msg->ctrl->type == SPI_MSG_CTRL_TRAFFIC_TYPE)
    {
      /* Validate control data length */
      if ((msg->ctrl->len == SPI_MSG_CTRL_TRAFFIC_TYPE_LEN) && (msg->ctrl->val != NULL))
      {
        /* Extract traffic type */
        traffic_type = *((uint8_t *)msg->ctrl->val);
      }
      else
      {
        spi_err("Invalid traffic type control info\r\n");
      }
    }
    /* Additional control types can be handled here in the future */
  }

  /* Verify data length does not exceed maximum transfer unit */
  if (msg->data_len > SPI_XFER_MTU_BYTES)
  {
    spi_err("Invalid len %" PRIu16 "\n", msg->data_len);
    return -3;
  }

  /* Process based on operation type */
  switch (msg->op_type)
  {
    case SPI_MSG_OP_DATA:
      /* Verify data operation has valid data pointer and length */
      if ((msg->data == NULL) || (msg->data_len == 0U))
      {
        return -1;
      }

      /* Allocate buffer for data operation */
      spi_trace(SPI_TP_WRITE, "spi_write data mode\r\n");
      buf = spi_buffer_alloc(msg->data_len, sizeof(struct spi_header));
      if (buf == NULL)
      {
        return -3;
      }

      data_len = msg->data_len;
      (void)spi_port_memcpy(buf->data, msg->data, msg->data_len);
      break;

    case SPI_MSG_OP_BUFFER:
      /* Verify buffer operation has valid buffer */
      if (msg->buffer == NULL)
      {
        return -1;
      }

      /* Use the provided pre-allocated buffer */
      spi_trace(SPI_TP_WRITE, "spi_write buffer mode\r\n");
      buf = msg->buffer;
      data_len = buf->len;
      break;

    default:
      /* Types unmanaged in write mode */
      break;
  }

  /* Set traffic type for the buffer */
  spi_buffer_set_traffic_type(buf, traffic_type);

  /* Push header space */
  if (spi_buffer_push(buf, sizeof(struct spi_header)) == NULL)
  {
    spi_err("Can't push SPI buffer header\r\n");
    if (msg->op_type == SPI_MSG_OP_DATA)
    {
      spi_buffer_free(buf);
    }
    return -4;
  }

  /* Prepare timeout value */
  if (timeout_ms < 0)
  {
    ticks = portMAX_DELAY;
  }
  else
  {
    ticks = pdMS_TO_TICKS(timeout_ms);
  }

  /* Send buffer to transmission queue */
  ret = xQueueSend(xfer_engine.txq, &buf, ticks);
  if (ret != pdTRUE)
  {
    /* Free buffer on queue send failure if it is allocated */
    if (msg->op_type == SPI_MSG_OP_DATA)
    {
      spi_buffer_free(buf);
    }
    return -5;
  }

  /* Notify transfer engine about pending data */
  (void)xEventGroupSetBits(xfer_engine.event, SPI_EVT_TXN_PENDING);

  /* Return number of bytes queued for transmission */
  return (int32_t)data_len;
}

int32_t spi_bind(unsigned char type, int32_t rxq_size)
{
  /* Use default queue size if requested size is invalid */
  if (rxq_size <= 0)
  {
    rxq_size = SPI_RXQ_LEN;
  }

  if (xfer_engine.initialized == 0)
  {
    spi_err("SPI transaction is NOT initialized!\r\n");
    return -1;
  }

  if (type >= SPI_MSG_CTRL_TRAFFIC_TYPE_MAX)
  {
    spi_err("Invalid traffic type: %d, max allowed: %d\r\n",
            type, (uint32_t)SPI_MSG_CTRL_TRAFFIC_TYPE_MAX - 1U);
    return -2;
  }

  /* Check if this type is already bound */
  if ((xfer_engine.rxq_bound & (1U << (uint8_t)type)) != 0U)
  {
    spi_err("Traffic type %d is already bound\r\n", type);
    return -3;
  }

  /* Create a new queue for this type with specified size */
  xfer_engine.rxq[type] = xQueueCreate((uint32_t)rxq_size, sizeof(void *));
  if (xfer_engine.rxq[type] == NULL)
  {
    spi_err("Failed to create queue for type %d\r\n", type);
    return -4;
  }

  /* Mark this type as bound */
  xfer_engine.rxq_bound |= (1U << (uint8_t)type);
  return 0;
}

int32_t spi_get_stats(struct spi_stat *stat)
{
  if (stat == NULL)
  {
    return -1;
  }

  *stat = xfer_engine.stat;
  return 0;
}

int32_t spi_rxd_callback_register(spi_msg_ctrl_t type, spi_rxd_notify_func_t cb, void *arg)
{
  if (type >= SPI_MSG_CTRL_TRAFFIC_TYPE_MAX)
  {
    return -1;
  }
  xfer_engine.cb[type] = cb;
  xfer_engine.cb_arg[type] = arg;
  return 0;
}

int32_t spi_on_txn_data_ready(void)
{
  if (xfer_engine.event != NULL)
  {
    spi_trace(SPI_TP_SLAVE_TXN_RDY, "slave txn/data ready\n");
#if ((tskKERNEL_VERSION_MAJOR > 10) || ((tskKERNEL_VERSION_MAJOR == 10) && (tskKERNEL_VERSION_MINOR >= 6)))
    if (xPortIsInsideInterrupt())
#else
    if (__get_IPSR() != 0U)
#endif /* tskKERNEL_VERSION_MAJOR */
    {
      BaseType_t xHigherPriorityTaskWoken = pdFALSE;
      (void)xEventGroupSetBitsFromISR(xfer_engine.event, SPI_EVT_TXN_RDY, &xHigherPriorityTaskWoken);
      portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
    else
    {
      (void)xEventGroupSetBits(xfer_engine.event, SPI_EVT_TXN_RDY);
    }
  }
  return 0;
}

int32_t spi_on_header_ack(void)
{
  if (xfer_engine.event != NULL)
  {
    spi_trace(SPI_TP_HDR_ACKED, "slave header ack\n");
#if ((tskKERNEL_VERSION_MAJOR > 10) || ((tskKERNEL_VERSION_MAJOR == 10) && (tskKERNEL_VERSION_MINOR >= 6)))
    if (xPortIsInsideInterrupt())
#else
    if (__get_IPSR() != 0U)
#endif /* tskKERNEL_VERSION_MAJOR */
    {
      BaseType_t xHigherPriorityTaskWoken = pdFALSE;
      (void)xEventGroupSetBitsFromISR(xfer_engine.event, SPI_EVT_HDR_ACKED, &xHigherPriorityTaskWoken);
      portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
    else
    {
      (void)xEventGroupSetBits(xfer_engine.event, SPI_EVT_HDR_ACKED);
    }
  }
  return 0;
}

