avnet-iotconnect/iotc-stm32-n6-w6x-kvs-webrtc/Middlewares/ST/ST67W6X_Network_Driver/Driver/W61_bus/spi_iface.c
static void spi_on_transaction_complete(void)
{
  if (xfer_engine.event != NULL)
  {
    spi_trace(SPI_TP_NONE, "hw txn done\n");
#if ((tskKERNEL_VERSION_MAJOR > 10) || ((tskKERNEL_VERSION_MAJOR == 10) && (tskKERNEL_VERSION_MINOR >= 6)))
    if (xPortIsInsideInterrupt())
#else
    if (__get_IPSR() != 0U)
#endif /* tskKERNEL_VERSION_MAJOR */
    {
      BaseType_t xHigherPriorityTaskWoken = pdFALSE;
      (void)xEventGroupSetBitsFromISR(xfer_engine.event, SPI_EVT_HW_XFER_DONE, &xHigherPriorityTaskWoken);
      portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
    else
    {
      (void)xEventGroupSetBits(xfer_engine.event, SPI_EVT_HW_XFER_DONE);
    }
  }
}

/** SPI transfer state strings */
static const char *spi_state_str[4] =
{
  [SPI_XFER_STATE_IDLE] = "Idle",
  [SPI_XFER_STATE_FIRST_PART] = "First Part Transaction",
  [SPI_XFER_STATE_SECOND_PART] = "Second Part Transaction",
  [SPI_XFER_STATE_TXN_DONE] = "Transfer Complete",
};

static void num2string64(char *out, int32_t out_strlen, const uint64_t num)
{
  uint64_t temp = num;
  int32_t count = 0;

  /* Count number of digit */
  while ((temp != 0U) && (count < out_strlen))
  {
    temp = temp / 10U;
    count++;
  }

  /* Write end of string char */
  out[count--] = '\0';

  temp = num;
  while (temp != 0U)
  {
    uint8_t digit = (uint8_t)((temp % 10U) + '0');
    out[count--] = (char)digit;
    temp = temp / 10U;
  }
}

static void spi_show_stat(struct spi_stat *stat)
{
  char count_ui64[STR64BIT_DIGIT];
  num2string64(count_ui64, STR64BIT_DIGIT, stat->tx_pkts);
  LogInfo("TX                    %-10s pkts\n", count_ui64);
  num2string64(count_ui64, STR64BIT_DIGIT, stat->tx_bytes);
  LogInfo("TX                    %-10s bytes\n", count_ui64);

  num2string64(count_ui64, STR64BIT_DIGIT, stat->rx_pkts);
  LogInfo("RX                    %-10s pkts\n", count_ui64);
  num2string64(count_ui64, STR64BIT_DIGIT, stat->rx_bytes);
  LogInfo("RX                    %-10s bytes\n", count_ui64);

  num2string64(count_ui64, STR64BIT_DIGIT, stat->rx_drop);
  LogInfo("drop                  %s\n", count_ui64);
  num2string64(count_ui64, STR64BIT_DIGIT, stat->mem_err);
  LogInfo("mem_err               %s\n", count_ui64);
  num2string64(count_ui64, STR64BIT_DIGIT, stat->rx_stall);
  LogInfo("stall                 %s\n", count_ui64);

  num2string64(count_ui64, STR64BIT_DIGIT, stat->io_err);
  LogInfo("IO error              %s\n", count_ui64);
  num2string64(count_ui64, STR64BIT_DIGIT, stat->hdr_err);
  LogInfo("header error          %s\n", count_ui64);
  num2string64(count_ui64, STR64BIT_DIGIT, stat->wait_txn_timeouts);
  LogInfo("wait_txn_timeout      %s\n", count_ui64);
  num2string64(count_ui64, STR64BIT_DIGIT, stat->wait_hdr_ack_timeouts);
  LogInfo("wait_hdr_ack_timeout  %s\n", count_ui64);
}

void spi_dump(void)
{
  EventBits_t bits;
  char pending_events[64] = {0};
  uint32_t pos = 0;

  if (xfer_engine.initialized == 0)
  {
    spi_err("spi transaction is NOT initialized!\n");
    return;
  }

  LogInfo("Master transfer state %s\n", spi_state_str[xfer_engine.state]);

  bits = xEventGroupGetBits(xfer_engine.event);
  if ((bits & SPI_EVT_TXN_RDY) != 0U)
  {
    pos = (uint32_t)snprintf(pending_events, sizeof(pending_events), ", TXN Ready");
  }
  if ((bits & SPI_EVT_TXN_PENDING) != 0U)
  {
    pos += (uint32_t)snprintf(pending_events + pos, sizeof(pending_events) - pos, ", TXN Pending");
  }
  if ((bits & SPI_EVT_HW_XFER_DONE) != 0U)
  {
    (void)snprintf(pending_events + pos, sizeof(pending_events) - pos, ", Hardware Xfer done");
  }
  LogInfo("SPI pending events    %" PRIu32 " %s\n", bits, pending_events);

  LogInfo("Slave data ready pin  %s\n", (spi_port_is_ready() == 1) ? "High" : "Low");

  spi_show_stat(&xfer_engine.stat);
  LogInfo("TX queue items        %" PRIu32 "\n", uxQueueMessagesWaiting(xfer_engine.txq));

  for (uint32_t i = 0; i < (uint32_t)SPI_MSG_CTRL_TRAFFIC_TYPE_MAX; i++)
  {
    if ((xfer_engine.rxq_bound & (1U << i)) != 0U)
    {
      LogInfo("RX queue[%" PRIu32 "] items     %" PRIu32 "\n", i,
              uxQueueMessagesWaiting(xfer_engine.rxq[i]));
    }
  }
}
